package frc.robot.subsystems.flywheel;

//בקלאסים האלה אתם לא צריכים להשתמש:
import frc.robot.Demo_helpers.FlyWheelBase;

//בכל הקלאסים האלה אתם צריכים להשתמש, לפחות פעם אחת. אם לא השתמשתם בהם, יש לכם טעות:
import frc.robot.Demo_helpers.Motor;
/* זה המנוע

יש לנו שני דרכים לקבוע כמה המנוע יסתובב
מחזיר feedforwardישירות, כמו שה voltage הראשונה היא לתת 
IDהשנייה היא לתת מנוע אחר לעקוב אחריו, בעזרת ה */

import com.ctre.phoenix6.configs.TalonFXConfiguration;
//זה אובייקט שאיתו מכילים הגדרות שונות על המנוע
//current אתם צריכים ליצור אחד כזה, ואז לערוך אותו כך שיכיל את המגבלות 

//ומשם תמשיכו לבד ,getConfigurator() לאחר שסיימתם ליצור את האובייקט - תקחו את אובייקט המנוע שלכם, תקראו לפונקציה


import static frc.robot.subsystems.flywheel.Const.*;
//כאן נמצאים כל מיני ערכים שתצטרכו - תסתכלו על הקובץ הזה
//לכל ערך יש שימוש כלשהו, אם לא השתמשתם בכולם עשיתם טעות


// (לשמור אותם לאחר כך) לכל ערך שאנחנו נותנים לרובוט צריך לעשות לוג 
// (בדוגמא הזו, הערך היחיד הזה הוא וולטים)
// log() כדי לעשות את זה, תקראו לפונקציה הסטטית


@SuppressWarnings("unused")
public class FlyWheel extends FlyWheelBase{
    

    /* (אחת מהפונקציות שאתם צריכים ליצור) :manual controller הסבר על הפונקציה
    לפעמים דברים לא עובדים, ואנחנו רוצים לשלוט על דברים ידנית עם השלט
    במקרים כאלה, נקבל ערך מהשלט בתחום בין -1 ל1, כאשר 1 אומר להסתובב בכי מהר ו-1 אומר הכי מהר אבל אחורה
    תזכרו שכאשר מנוע מקבל וולטים שליליים הוא מסתובב אחורה */
}